In [1]:
# dependencies
import pandas as pd
import numpy as np

In [2]:
# relevant page from original data file was saved as a csv file
# import file
file = "../resources/international_airline_activity_table1_2009tocurrent_1120.csv"

# Read the file results
file_df = pd.read_csv(file)

file_df.head()

,Month,Scheduled Operator,Country to/from,Passengers In,Freight In,Mail In,Passengers Out,Freight Out,Mail Out,Year,"<< This year is based on the month selected in cell H2 in sheet ""Totals"" - it is only a calendar year if the month in sheet ""Totals"" is set to December",Unnamed: 11
0,Jan-09,Aerolineas Argentinas,Argentina,"3,021",4.3,0.6,"1,959",8.3,0.0,2009,NaN,NaN
1,Jan-09,Aerolineas Argentinas,New Zealand,627,76.3,0.0,"1,821",68.5,0.0,2009,NaN,NaN
2,Jan-09,Air Caledonie,New Caledonia,"6,658",4.9,0.6,"5,365",68.6,1.3,2009,NaN,NaN
3,Jan-09,Air Canada,Canada,"7,489",174.8,0.0,"6,424",105.2,0.0,2009,NaN,NaN
4,Jan-09,Air China,China,"12,458",201.3,18.6,"11,163",142.4,2.9,2009,NaN,NaN

In [3]:
# get columns that we will need for analysis
file2_df = file_df.loc[:, ["Month", "Country to/from", "Passengers In", "Freight In", "Mail In", "Passengers Out", "Freight Out", "Mail Out", "Year" ]]
file2_df

,Month,Country to/from,Passengers In,Freight In,Mail In,Passengers Out,Freight Out,Mail Out,Year
0,Jan-09,Argentina,"3,021",4.3,0.6,"1,959",8.3,0.0,2009
1,Jan-09,New Zealand,627,76.3,0.0,"1,821",68.5,0.0,2009
2,Jan-09,New Caledonia,"6,658",4.9,0.6,"5,365",68.6,1.3,2009
3,Jan-09,Canada,"7,489",174.8,0.0,"6,424",105.2,0.0,2009
4,Jan-09,China,"12,458",201.3,18.6,"11,163",142.4,2.9,2009
...,...,...,...,...,...,...,...,...,...
15052,Nov-20,Korea,..,..,..,..,254.8,0.0,2020
15053,Nov-20,Singapore,..,..,..,..,28.9,0.0,2020
15054,Nov-20,USA,..,"1,484.4",0.0,..,..,..,2020
15055,Nov-20,Vietnam,248,437.1,0.0,691,534.2,8.8,2020
15056,Nov-20,China,272,144.1,6.6,"2,450",118.2,0.0,2020

In [4]:
# replace symbols with 0 as per original data notes
file2_df = file2_df.replace('-','0', regex=True)
file2_df

,Month,Country to/from,Passengers In,Freight In,Mail In,Passengers Out,Freight Out,Mail Out,Year
0,Jan009,Argentina,"3,021",4.3,0.6,"1,959",8.3,0.0,2009
1,Jan009,New Zealand,627,76.3,0.0,"1,821",68.5,0.0,2009
2,Jan009,New Caledonia,"6,658",4.9,0.6,"5,365",68.6,1.3,2009
3,Jan009,Canada,"7,489",174.8,0.0,"6,424",105.2,0.0,2009
4,Jan009,China,"12,458",201.3,18.6,"11,163",142.4,2.9,2009
...,...,...,...,...,...,...,...,...,...
15052,Nov020,Korea,..,..,..,..,254.8,0.0,2020
15053,Nov020,Singapore,..,..,..,..,28.9,0.0,2020
15054,Nov020,USA,..,"1,484.4",0.0,..,..,..,2020
15055,Nov020,Vietnam,248,437.1,0.0,691,534.2,8.8,2020
15056,Nov020,China,272,144.1,6.6,"2,450",118.2,0.0,2020

In [6]:
# save as csv file
file2_df.to_csv('cleansheet1.csv', index=False)